Demo_Kabeli/src/Documents/ЗаданияНаМонтаж/ЗаданияНаМонтаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданияНаМонтаж</name>
  <basedOn>Catalog.ЖурналыУчетаКабельнойПродукции</basedOn>
  <registerRecords>InformationRegister.ДанныеПоЗаданиямПоПрокладкеКабелей</registerRecords>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналУчетаКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </attributes>
</mdclass:Document>

Demo_Kabeli/src/InformationRegisters/ДанныеПоЗаданиямПоПрокладкеКабелей/ДанныеПоЗаданиямПоПрокладкеКабелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПоЗаданиямПоПрокладкеКабелей</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаданий</types>
    </type>
  </resources>
  <dimensions>
    <name>ЖурналУчетаКабельнойЛинии</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Demo_Kabeli/src/Enums/СтатусыЗаданий/СтатусыЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаданий</name>
  <enumValues>
    <name>Создано</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
</mdclass:Enum>

Demo_Kabeli/src/Documents/ЗаданияНаМонтаж/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ДанныеПоЗаданиямПоПрокладкеКабелей.Записывать = Истина;
	
	Движение                           = Движения.ДанныеПоЗаданиямПоПрокладкеКабелей.Добавить();
	Движение.Период                    = Дата;
	Движение.ЖурналУчетаКабельнойЛинии = ЖурналУчетаКабельнойПродукции;  
	Движение.Подрядчик                 = Подрядчик;
	Движение.Статус                    = Перечисления.СтатусыЗаданий.Создано;
	
КонецПроцедуры
